<div class="mt-2 pt-2  flex flex-wrap gap-4 justify-between items-center">

    <div class="flex items-center gap-4">
        <span class="text-xs font-black text-gray-400 uppercase">Поделиться:</span>
        <div class="flex gap-2">
            <button class="p-2 bg-[#0077FF] text-white rounded-lg hover:opacity-90"><svg class="w-4 h-4"
                    fill="currentColor" viewBox="0 0 24 24">
                    <path
                        d="M13.162 18.994c-6.098 0-9.57-4.174-9.715-11.103h3.04c.103 5.089 2.346 7.243 4.124 7.688V7.891h2.865v4.388c1.751-.188 3.593-2.176 4.215-4.388h2.865a10.15 10.15 0 01-3.868 5.485c2.408 1.127 5.02 3.42 5.86 5.618h-3.146c-.657-2.049-2.285-3.626-4.275-3.824v3.824h-1.965z" />
                </svg></button>
            <button class="p-2 bg-[#24A1DE] text-white rounded-lg hover:opacity-90"><svg class="w-4 h-4"
                    fill="currentColor" viewBox="0 0 24 24">
                    <path
                        d="M12 2C6.48 2 2 6.48 2 12s4.48 10 10 10 10-4.48 10-10S17.52 2 12 2zm4.64 6.8c-.15 1.58-.8 5.42-1.13 7.19-.14.75-.42 1-.68 1.03-.58.05-1.02-.38-1.58-.75-.88-.58-1.38-.94-2.23-1.5-.99-.65-.35-1.01.22-1.59.15-.15 2.71-2.48 2.76-2.69a.2.2 0 00-.05-.18c-.06-.05-.14-.03-.21-.02-.09.02-1.49.95-4.22 2.79-.4.27-.76.41-1.08.4-.36-.01-1.04-.2-1.55-.37-.63-.2-1.12-.31-1.08-.66.02-.18.27-.36.74-.55 2.91-1.27 4.85-2.11 5.83-2.51 2.78-1.16 3.35-1.36 3.73-1.36.08 0 .27.02.39.12.1.08.13.19.14.27-.01.06.01.24 0 .33z" />
                </svg></button>
        </div>
    </div>
</div>